# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bat'
brew 'bottom'
brew 'colima'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'delta'
brew 'fd'
brew 'ffmpeg'
brew 'htop'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'ripgrep'
brew 'stripe/stripe-cli/stripe'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Development
brew 'imagemagick'
brew 'nvm'
brew 'poetry'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Apps
cask '1password'
cask 'arc'
cask 'bartender'
cask 'brave-browser'
cask 'calibre'
cask 'cursor'
cask 'cryptomator'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'hiddenbar'
cask 'little-snitch'
cask 'loom'
cask 'lm-studio'
cask 'krisp'
cask 'nordvpn'
cask 'obsidian'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'warp'
cask 'zoom'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Tailscale', id: 1475387142
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
